In [57]:
import pandas as pd
import numpy as np

In [58]:
# arr1= np.array([[1,2,3,4], [4,3,6,7], [2,8,9,3]])

arr1 = np.random.randn(3,4)
row = np.array(['A', 'B', 'C'])
col = np.array(['W', 'X', 'Y','Z'])

In [59]:
df = pd.DataFrame(data = arr1, index = row, columns = col)
df

          W         X         Y         Z
A -1.222113  1.728972 -0.015695  2.087030
B  0.505133  0.645793  2.302847  0.770123
C -1.282678  0.488353  1.093620 -1.178172

In [60]:
# iloc is use for calling the index location
df.iloc[0]

W   -1.222113
X    1.728972
Y   -0.015695
Z    2.087030
Name: A, dtype: float64

In [61]:
# loc is use for calling column location
df.loc['A']

W   -1.222113
X    1.728972
Y   -0.015695
Z    2.087030
Name: A, dtype: float64

In [62]:
dfx = df[["W","Y"]]
dfx

          W         Y
A -1.222113 -0.015695
B  0.505133  2.302847
C -1.282678  1.093620

In [63]:
df['Q'] = df['W'] + df['Y']
df

          W         X         Y         Z         Q
A -1.222113  1.728972 -0.015695  2.087030 -1.237809
B  0.505133  0.645793  2.302847  0.770123  2.807980
C -1.282678  0.488353  1.093620 -1.178172 -0.189058

In [64]:
df.drop(["X"], axis = 1)

          W         Y         Z         Q
A -1.222113 -0.015695  2.087030 -1.237809
B  0.505133  2.302847  0.770123  2.807980
C -1.282678  1.093620 -1.178172 -0.189058

In [65]:
df.drop(["C"], axis = 0)

          W         X         Y         Z         Q
A -1.222113  1.728972 -0.015695  2.087030 -1.237809
B  0.505133  0.645793  2.302847  0.770123  2.807980

In [66]:
# "inplace" parametre helps to make our changes pamanent for "drop" function
# df.drop(["X"], axis = 1, inplace= true)

In [67]:
x = np.array
row = np.array(['A', 'B', 'C', 'D'])
col = np.array(['U', 'V', 'W', 'X', 'Y'])

In [68]:
dfs = pd.DataFrame(data = x, index = row, columns = col)
dfs

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  2.0  1.0  7.0

In [69]:
dfs.mean()

U    4.000000
V    3.333333
W    5.000000
X    3.500000
Y    3.666667
dtype: float64

In [70]:
dfs.std()

U    2.645751
V    0.577350
W    2.943920
X    3.535534
Y    3.055050
dtype: float64

In [71]:
dfs.dropna()

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0

In [72]:
df

          W         X         Y         Z         Q
A -1.222113  1.728972 -0.015695  2.087030 -1.237809
B  0.505133  0.645793  2.302847  0.770123  2.807980
C -1.282678  0.488353  1.093620 -1.178172 -0.189058

In [73]:
df > 0

       W     X      Y      Z      Q
A  False  True  False   True  False
B   True  True   True   True   True
C  False  True   True  False  False

In [76]:
dfg = df[df>0]
dfg

          W         X         Y         Z        Q
A       NaN  1.728972       NaN  2.087030      NaN
B  0.505133  0.645793  2.302847  0.770123  2.80798
C       NaN  0.488353  1.093620       NaN      NaN

In [77]:
dfg.fillna(0)

          W         X         Y         Z        Q
A  0.000000  1.728972  0.000000  2.087030  0.00000
B  0.505133  0.645793  2.302847  0.770123  2.80798
C  0.000000  0.488353  1.093620  0.000000  0.00000

In [83]:
new_arr = {"COMPANY":["GOOG", 'GOOG', "FB", 'FB', "BDCL", 'BDCL'],
           
           "PERSON":["Ndidi", "Grace", "Gbenga", 'Precious', "Tobi", "Ola"],
           "Score": [300,200,700,700,350,200]
          }

In [85]:
dfr = pd.DataFrame(new_arr)
dfr

  COMPANY    PERSON  Score
0    GOOG     Ndidi    300
1    GOOG     Grace    200
2      FB    Gbenga    700
3      FB  Precious    700
4    BDCL      Tobi    350
5    BDCL       Ola    200

In [86]:
dfr.mean()

Score    408.333333
dtype: float64

In [87]:
dfr.describe()

            Score
count    6.000000
mean   408.333333
std    233.273802
min    200.000000
25%    225.000000
50%    325.000000
75%    612.500000
max    700.000000

In [88]:
dfr[['PERSON']]

     PERSON
0     Ndidi
1     Grace
2    Gbenga
3  Precious
4      Tobi
5       Ola

In [89]:
dfr[['PERSON']].count()

PERSON    6
dtype: int64

In [90]:
dfr

  COMPANY    PERSON  Score
0    GOOG     Ndidi    300
1    GOOG     Grace    200
2      FB    Gbenga    700
3      FB  Precious    700
4    BDCL      Tobi    350
5    BDCL       Ola    200

In [92]:
grpComp = dfr.groupby("COMPANY")
grpComp

In [93]:
grpComp.sum()

         Score
COMPANY
BDCL       550
FB        1400
GOOG       500

In [94]:
dfr

  COMPANY    PERSON  Score
0    GOOG     Ndidi    300
1    GOOG     Grace    200
2      FB    Gbenga    700
3      FB  Precious    700
4    BDCL      Tobi    350
5    BDCL       Ola    200

In [95]:
dfr['Score'].unique()

array([300, 200, 700, 350], dtype=int64)

In [96]:
len(dfr['Score'].unique())

4

In [97]:
dfr['Score'].nunique()

4

In [99]:
dfr['Score'].unique().sum()

1550